[
    {
        "type": "title",
        "info": {
            "theme": "5",
            "title": "Acerca de"
        }
    },
    {
        "type": "description-image",
        "info": {
            "theme": "2",
            "type": "2",
            "title": "¿Quién soy yo?",
            "decription": "Me llamo <b>Cesar Torres</b> y soy estudiante de <b>Ingeniería de sistemas y computación</b> de la universidad Nacional de Colombia computación y tecnólogo en <b>Análisis y desarrollo de Sistemas de información</b>.<br>Soy una persona muy apasionada a mi carrera, en especial a todo lo relacionado a la <b>programación y el desarrollo de software</b>. <br>Quiero aprender mucho acerca de todo lo que me permita <b> crear soluciones</b>, contribuir al desarrollo de una sociedad mas equilibrada y en general a mejorar la calidad de vida a las personas a través de la tecnología. <br><b>Todo lo que aprendes será inútil si no lo empleas para constituir un mundo mejor</b>.",
            "image": "/Images/about_me1.png"
        }
    }, 
    {
        "type": "description-image",
        "info": {
            "theme": "1",
            "type": "1",
            "title": "¿Que conocimientos tengo?",
            "decription": "He trabajado a nivel académico desarrollando proyectos de software principalmente en <b>Java SE</b>, tengo bastantes conocimientos en el lenguaje para el desarrollo de aplicaciones de escritorio con GUI personalizadas con <b>Swing</b>, almacenamiento local de información, a través de <b>bases de datos</b> y comunicación con otros lenguajes de programación por instruciones <b>CMD</b>. <br> Conozco a profundidad muchas caracteristicas del lenguaje <b>Python</b> incluyendo el tratamiendo de datos con <b>Numpy</b> y <b>Pandas</b>, Matematicas avanzadas con <b>Sympy</b> y <b>Scypy</b> y algunos algoritmos básicos de intenligenica artifical con <b>Scikit-learn</b>. <br> También he trabajado en desarrollo web en <b>Frontend</b> empleando <b>HTML</b>, <b>CSS</b>, <b>JavaScript</b> y <b>React.js</b> y en <b>Backend</b> empleando <b>PHP</b> y <b>Node.js</b>. <br> He aprendido a trabajar con otros lenguajes de programación a un nivel mas básico. Lenguajes como <b>C, C++, C#, Visual Basic, MathLab y Scilab</b>. <br> En lo relacionado al manejo de bases de datos tengo conocimeientos en <b>MySQL</b>, <b>SQLServer</b>, <b>OracleSQL</b> y <b>SQLite</b>. <br> Como conocimientos adicionales relacionados al desarrollo he trabajado con <b>Java</b> y <b>XML</b> para dearrollo de aplicaciones en <b>Android</b>, <b>LaTeX</b> para la realización de informes matemáticos, <b>Git</b> par el menejo de repositorios y <b>Json</b> para el intercambio de datos.", 
            "image": "/Images/about_me2.jpg"
        }
    }, 
    {
        "type": "slides",
        "info": {
            "theme": "3",
            "title": "Mi organización de registro y aprendizaje",
            "decription": "Uno de mis objetivos principales es dejar un registro claro y concreto de mi conocimiento para que otros puedan hacer uso de el. Para lograr esto me he concentrado en organizar de la mejor manera el conocimiento que he adquirido a través de mi carrera como programador e ingeniero de sistemas con las siguientes herramientas y organización:",
            "subtitles": [
                "Apuntes en LaTeX (Overleaf)",
                "Códigos en archivos de texto plano (Sublime Text)",
                "Programas, directorios y enlaces accesibles (Winstep)"
            ],
            "subdescriptions": [
                "<b> LaTeX</b> es un lenguaje de marcado orientado a realizar informes de tipo matemático. Yo empleo éste lenguaje en todas las materias que tienen componentes matemáticos puesto que este me permite dejar un <b>registro claro</b> del conocimiento que adquiero. La forma en que aplico el lenguaje es creando un documento por cada materia, en cada materia creo una distribución de dos columnas para añadir pequeñas cajas y en cada caja almaceno información concreta de cada componente de la materia y su descripción.",
                "Existen muchas herramientas que permiten gestionar códigos, incluso entornos de desarrollo completos, sin embargo considero que uno de los elementos mas fuertes de un programador son sus propias estructuras de código. Yo utilizo <b>Sublime Text</b> para <b>organizar</b> y <b>comentar</b> todos los lenguajes que voy aprendiendo. Esta herramienta me permite visualizar adecuadamente una gran cantidad de lenguajes, organizar cada componente de cada lenguaje en archivos y carpetas y, lo mas importante, acceder a mis estructuras de una forma rápida y sencilla.",
                "Para poner en practica el conocimiento adquirido es necesario tener las herramientas necesarias para proceder, un orden que permita el <b>acceso eficaz</b> a dichas herramientas, a la información y a los enlaces que se requieran. Utilizando <b>Winstep</b> gestiono mi escritorio personal y lo tengo organizado de tal forma que puedo acceder rápidamente a todas las herramientas que necesito para obtener información, generar conocimiento y desarrollar software."
            ],
            "images": [
                "/Images/about_me3.png",
                "/Images/about_me4.png",
                "/Images/about_me5.png"
            ]
        }
    },
    {
        "type": "description",
        "info": {
            "theme": "2",
            "title": "¿Cómo planeo aportarle a la sociedad?",
            "decription": "<b>Cada persona tiene cualidades y capacidades distintas, por lo tanto no existe un único camino para aportarle al mundo. <br></b> En mi caso particular planeo aprovechar la <b>tecnología actual</b>, aplicar la <b>ingeniería</b> y el <b>desarrollo de software</b> para crear productos y servicios que le permitan a las personas <b>reducir</b> al máximo el esfuerzo de realizar sus labores diarias. <br>También planeo crear formas y herramientas que permitan <b>simplificar</b> la complejidad de la información que existe en las ciencias exactas, delegándole a las maquinas procesos técnicos que no requieren capacidad de análisis. <br> Por último planeo dejar, en la medida de lo posible, un <b>registro</b> lo suficientemente claro de todo el <b>conocimiento</b> que adquiera a lo largo de mi vida, mis formas de trabajo, mi documentación y mi experiencia, todo esto para que las personas que lo vean puedan sacar provecho de mi trabajo y seguir contribuyendo a una mejor sociedad."
        }
    }
]